using System.Collections.Generic;
using UI.业务;
using UI.业务.应用配置;
using UI.业务.状态;
using UI.业务.资源配置;
using UI.基础;
using UI.数据.查询;
using UI.系统;
using UI.系统.帮助;
using UI.设备;
using UI.设备.互联接口;
using UI.设备.核心设备;
using UI.设备.终端设备;
using UI.调度;
using UI.调度.地图;
using UI.调度.地图.轨迹回放;
using UI.调度.短信;
using UI.调度.视频;
using UI.调度.通话;

namespace UI
{
    static class H系统菜单
    {
        public static List<M一级菜单> 一级功能列表 { get; private set; }


        static H系统菜单()
        {
            一级功能列表 = new List<M一级菜单>();
            if (Program.概念版)
            {
                H概念版系统菜单.设置(一级功能列表);
            }
            else
            {
                H现实版系统菜单.设置(一级功能列表);
            }
        }
    }

    class H概念版系统菜单
    {
        private static List<M一级菜单> 一级功能列表;

        public static void 设置(List<M一级菜单> 菜单)
        {
            一级功能列表 = 菜单;
            添加设备接入菜单();
            添加业务配置菜单();
            添加运营状态菜单();
            添加运营数据菜单();
            添加系统设置菜单();

            添加调度菜单();
        }

        private static void 添加设备接入菜单()
        {
            var __一级菜单 = new M一级菜单 { 名称 = "设备接入", 图片 = global::UI.Properties.Resources.功能 };

            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "核心网",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "交换机",   创建窗口 = ()=> new F交换机() },
                    new M三级菜单 { 名称 = "基站列表",   创建窗口 = ()=> new F基站_列表() },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "网关",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "网关列表",   创建窗口 = ()=> new F网关_列表() },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "应用服务器",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "调度",   创建窗口 = ()=> new F通用设备() },
                    new M三级菜单 { 名称 = "话单",   创建窗口 = ()=> new F通用设备() },
                    new M三级菜单 { 名称 = "GIS",   创建窗口 = ()=> new F通用设备() },
                    new M三级菜单 { 名称 = "短信",  创建窗口 = ()=> new F通用设备() },
                },
            });

            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "外部平台",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "PGIS平台",  创建窗口 = ()=> new FPGIS平台() },
                    new M三级菜单 { 名称 = "省级网管",  创建窗口 = ()=> new F省级网管() },
                    new M三级菜单 { 名称 = "省级调度",   },
                    new M三级菜单 { 名称 = "信息查询平台",  创建窗口 = ()=> new F信息查询平台() },
                },
            });

            一级功能列表.Add(__一级菜单);
        }

        private static void 添加业务配置菜单()
        {
            var __一级菜单 = new M一级菜单 { 名称 = "业务配置", 图片 = global::UI.Properties.Resources.功能 };
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "基础",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "号码方案",  创建窗口 = ()=> new F号码资源() },
                },
            });

            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "终端",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "手台",  创建窗口 = ()=> new F移动台() },
                    new M三级菜单 { 名称 = "车台",  创建窗口 = ()=> new F移动台() },
                    new M三级菜单 { 名称 = "PC" },
                    new M三级菜单 { 名称 = "限制使用",  创建窗口 = ()=> new F限制使用() },
                    new M三级菜单 { 名称 = "报废",   },
                },
            });

            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "组号",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "市级组",  创建窗口 = ()=> new F分组方案_普通组() },
                    new M三级菜单 { 名称 = "部省组" },
                    new M三级菜单 { 名称 = "并组",  创建窗口 = ()=> new F分组方案_并组() },
                    new M三级菜单 { 名称 = "动态组",  创建窗口 = ()=> new F分组方案_动态组() },
                },
            });

            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "媒体",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "语音",  创建窗口 = ()=> new F语音() },
                    new M三级菜单 { 名称 = "短信",   },
                    new M三级菜单 { 名称 = "GPS",  创建窗口 = ()=> new FGIS() },
                },
            });

            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "资源",
                子菜单 = new List<M三级菜单>
                {
                    //new M三级菜单 { 名称 = "号码资源",  创建窗口 = ()=> new F号码资源() },
                    new M三级菜单 { 名称 = "基站分布",  创建窗口 = ()=> new F基站分布() },
                    new M三级菜单 { 名称 = "频率资源",  创建窗口 = ()=> new F频率资源() },
                    new M三级菜单 { 名称 = "媒体资源",  创建窗口 = ()=> new F媒体资源() },
                    new M三级菜单 { 名称 = "优先级",  创建窗口 = ()=> new F优先级() },
                },
            });

            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "互联",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "漫游", },
                    new M三级菜单 { 名称 = "相邻交换机", 创建窗口 = ()=> new F相邻交换机() },
                },
            });

            一级功能列表.Add(__一级菜单);
        }

        private static void 添加运营状态菜单()
        {
            var __一级菜单 = new M一级菜单 { 名称 = "运营状态", 图片 = global::UI.Properties.Resources.功能 };
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "概览",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "状态概览", 创建窗口 = ()=> new F状态概览() , 允许关闭 = false },
                    new M三级菜单 { 名称 = "地图概览", 创建窗口 = ()=> new F地图概览()  },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "资源",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "信道监控",  创建窗口 = ()=> new F信道监控() },
                    new M三级菜单 { 名称 = "业务监控",  创建窗口 = ()=> new F业务监控() },
                    new M三级菜单 { 名称 = "用户分布",  创建窗口 = ()=> new F用户分布() },
                    new M三级菜单 { 名称 = "用户查询",  创建窗口 = ()=> new F用户状态() },
                    new M三级菜单 { 名称 = "组查询",  创建窗口 = ()=> new F组状态() },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "硬件",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "CPU内存",  创建窗口 = ()=> new F设备监控() },
                    new M三级菜单 { 名称 = "链路",  创建窗口 = ()=> new F设备监控() },
                },
            });
            一级功能列表.Add(__一级菜单);
        }

        private static void 添加运营数据菜单()
        {
            var __一级菜单 = new M一级菜单 { 名称 = "运营数据", 图片 = global::UI.Properties.Resources.功能 };
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "配置",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "数据保存期限",  创建窗口 = ()=> new F数据保存期限() },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "话单",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "查询", 描述="查询话单",  创建窗口 = ()=> new F查询话单() },
                    new M三级菜单 { 名称 = "统计",描述="统计话单", 创建窗口 = ()=> new 数据.统计.F统计话单() },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "短信",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "查询", 描述="查询短信",  创建窗口 = ()=> new F查询短信()  },
                    new M三级菜单 { 名称 = "统计", 描述="统计短信", },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "GPS",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "查询", 描述="查询GPS",   },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "勤务",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "查询", 描述="查询勤务",    },
                    new M三级菜单 { 名称 = "统计", 描述="统计勤务",    },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "硬件",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "查询", 描述="查询硬件",    },
                    new M三级菜单 { 名称 = "统计", 描述="统计硬件",    },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "告警",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "通知方式",  创建窗口 = ()=> new F通知方式() },
                    new M三级菜单 { 名称 = "查询", 描述="查询告警",  创建窗口 = ()=> new F查询告警()  },
                    new M三级菜单 { 名称 = "统计",描述="统计告警", },
                },
            });
            一级功能列表.Add(__一级菜单);
        }

        private static void 添加系统设置菜单()
        {
            var __一级菜单 = new M一级菜单 { 名称 = "系统设置", 图片 = global::UI.Properties.Resources.设置 };
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "基础数据",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "行政区划",  创建窗口 = ()=> new F行政区划() },
                    new M三级菜单 { 名称 = "部门架构",  创建窗口 = ()=> new F部门架构() },
                    new M三级菜单 { 名称 = "设备厂商",  创建窗口 = ()=> new F设备厂商() },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "用户",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "账号管理",  创建窗口 = ()=> new F账号管理()  },
                    new M三级菜单 { 名称 = "修改密码",  创建窗口 = ()=> new F修改密码()  },
                    new M三级菜单 { 名称 = "个性化",  创建窗口 = ()=> new F个性化()  },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "备份还原",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "备份还原",  创建窗口 = ()=> new F备份还原()  },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "帮助",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "使用手册",  },
                    new M三级菜单 { 名称 = "更新日志",  创建窗口 = ()=> new F更新日志()  },
                    new M三级菜单 { 名称 = "反馈",  创建窗口 = ()=> new F反馈()  },
                    new M三级菜单 { 名称 = "关于",  创建窗口 = ()=> new F关于()  },
                },
            });

            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "日志",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "操作日志", 描述="操作日志",  创建窗口 = ()=> new F查询日志()  },
                    new M三级菜单 { 名称 = "调试日志", 描述="调试日志",  创建窗口 = ()=> new F查询日志()  },
                },
            });
            一级功能列表.Add(__一级菜单);
        }

        private static void 添加调度菜单()
        {
            var __一级菜单 = new M一级菜单 { 名称 = "调度", 图片 = global::UI.Properties.Resources.锁定 };
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "预案",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "预案管理",  创建窗口 = ()=> new F预案管理() },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "呼叫",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "预案呼叫",  创建窗口 = ()=> new F通话() },
                    new M三级菜单 { 名称 = "区域呼叫",  创建窗口 = ()=> new F区域呼叫() },
                    new M三级菜单 { 名称 = "外部呼叫",  创建窗口 = ()=> new F外部呼叫() },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "短信",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "发短信",  创建窗口 = ()=> new F短信_发送短信()  },
                    new M三级菜单 { 名称 = "收件箱",  创建窗口 = ()=> new F短信_短信箱() },
                    new M三级菜单 { 名称 = "内置短信",  创建窗口 = ()=> new F内置短信() },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "GIS",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "实时定位",  创建窗口 = ()=> new F地图_实时定位() },
                    new M三级菜单 { 名称 = "轨迹回放",  创建窗口 = ()=> new F地图_轨迹回放() },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "视频",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "道路",  创建窗口 = ()=> new F视频() },
                    new M三级菜单 { 名称 = "手台摄像头",  创建窗口 = ()=> new F手机摄像头() },
                    new M三级菜单 { 名称 = "公网手机摄像头",  创建窗口 = ()=> new F手机摄像头() },
                    new M三级菜单 { 名称 = "公共场所",  创建窗口 = ()=> new F视频() },
                },
            });

            一级功能列表.Add(__一级菜单);
        }

    }

    class H现实版系统菜单
    {
        private static List<M一级菜单> 一级功能列表;

        public static void 设置(List<M一级菜单> 菜单)
        {
            一级功能列表 = 菜单;
            添加设备接入菜单();
            添加业务配置菜单();
            添加用户配置菜单();
            添加运营状态菜单();
            添加运营数据菜单();
            添加系统设置菜单();
        }

        private static void 添加设备接入菜单()
        {
            var __一级菜单 = new M一级菜单 { 名称 = "设备接入", 图片 = global::UI.Properties.Resources.功能 };
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "内部设备",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "交换机",   创建窗口 = ()=> new F交换机() },
                    new M三级菜单 { 名称 = "基站",   创建窗口 = ()=> new F基站_列表() },
                    new M三级菜单 { 名称 = "网关",   创建窗口 = ()=> new F网关_列表() },
                    new M三级菜单 { 名称 = "应用服务器",  创建窗口 = ()=> new F应用_列表() },
                    //new M三级菜单 { 名称 = "外观与接口",  构造内容 = ()=> new F外观与接口()  },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "互联设备",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "相邻交换机",  创建窗口 = ()=> new F相邻交换机() },
                    new M三级菜单 { 名称 = "外部基站",  创建窗口 = ()=> new F外部基站_列表() },
                    new M三级菜单 { 名称 = "省级网管",  创建窗口 = ()=> new F省级网管() },
                    new M三级菜单 { 名称 = "PGIS平台",  创建窗口 = ()=> new FPGIS平台() },
                    new M三级菜单 { 名称 = "外部调度平台",   },
                    new M三级菜单 { 名称 = "信息综合查询平台",   },

                },
            });
            一级功能列表.Add(__一级菜单);
        }

        private static void 添加业务配置菜单()
        {
            var __一级菜单 = new M一级菜单 { 名称 = "业务配置", 图片 = global::UI.Properties.Resources.功能 };
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "所有",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "号码范围",  创建窗口 = ()=> new F号码资源2() },
                    new M三级菜单 { 名称 = "语音",  创建窗口 = ()=> new F语音() },
                    new M三级菜单 { 名称 = "频率资源",  创建窗口 = ()=> new F频率资源() },
                    new M三级菜单 { 名称 = "相邻基站",  创建窗口 = ()=> new F基站分布() },
                    new M三级菜单 { 名称 = "媒体资源",  创建窗口 = ()=> new F媒体资源() },
                },
            });
            一级功能列表.Add(__一级菜单);
        }

        private static void 添加用户配置菜单()
        {
            var __一级菜单 = new M一级菜单 { 名称 = "用户配置", 图片 = global::UI.Properties.Resources.功能 };
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "基础数据",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "设备厂商",  创建窗口 = ()=> new F设备厂商() },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "个号",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "手台",  创建窗口 = ()=> new F移动台() },
                    new M三级菜单 { 名称 = "车台",  创建窗口 = ()=> new F移动台() },
                    new M三级菜单 { 名称 = "遥晕遥毙",  创建窗口 = ()=> new F限制使用() },
                    new M三级菜单 { 名称 = "禁用",  创建窗口 = ()=> new F分组方案_并组() },
                    new M三级菜单 { 名称 = "SIP电话",  },
                    new M三级菜单 { 名称 = "内线",   },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "组号",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "所有组",  创建窗口 = ()=> new F分组方案_普通组() },
                    new M三级菜单 { 名称 = "并组",  创建窗口 = ()=> new F分组方案_并组() },
                    new M三级菜单 { 名称 = "动态组",  创建窗口 = ()=> new F分组方案_动态组() },
                    new M三级菜单 { 名称 = "优先级",  创建窗口 = ()=> new F分组方案_优先级() },
                },
            });
            一级功能列表.Add(__一级菜单);
        }

        private static void 添加运营状态菜单()
        {
            var __一级菜单 = new M一级菜单 { 名称 = "运营状态", 图片 = global::UI.Properties.Resources.功能 };
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "所有",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "状态概览", 创建窗口 = ()=> new F状态概览() , 允许关闭 = false},
                    new M三级菜单 { 名称 = "信道监控",  创建窗口 = ()=> new F信道监控() },
                    new M三级菜单 { 名称 = "设备监控",  创建窗口 = ()=> new F设备监控() },
                    new M三级菜单 { 名称 = "业务监控",  创建窗口 = ()=> new F业务监控() },
                    new M三级菜单 { 名称 = "用户分布",  创建窗口 = ()=> new F用户分布() },
                    new M三级菜单 { 名称 = "用户查询",  创建窗口 = ()=> new F用户状态() },
                    new M三级菜单 { 名称 = "组查询",  创建窗口 = ()=> new F组状态() },
                },
            });

            一级功能列表.Add(__一级菜单);
        }

        private static void 添加运营数据菜单()
        {
            var __一级菜单 = new M一级菜单 { 名称 = "运营数据", 图片 = global::UI.Properties.Resources.功能 };
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "设置",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "数据保存期限",  创建窗口 = ()=> new F数据保存期限() },
                    new M三级菜单 { 名称 = "告警级别",  创建窗口 = ()=> new F告警级别() },
                    new M三级菜单 { 名称 = "通知方式",  创建窗口 = ()=> new F通知方式() },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "查询",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "查询话单", 描述="查询话单",  创建窗口 = ()=> new F查询话单() },
                    new M三级菜单 { 名称 = "查询告警", 描述="查询告警",  创建窗口 = ()=> new F查询告警()  },
                    new M三级菜单 { 名称 = "查询日志", 描述="查询日志",  创建窗口 = ()=> new F查询日志()  },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "统计",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "统计话单",描述="统计话单", 创建窗口 = ()=> new 数据.统计.F统计话单() },
                    new M三级菜单 { 名称 = "统计告警", 描述="统计告警", },
                },
            });
            一级功能列表.Add(__一级菜单);
        }

        private static void 添加系统设置菜单()
        {
            var __一级菜单 = new M一级菜单 { 名称 = "系统设置", 图片 = global::UI.Properties.Resources.设置 };
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "基础数据",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "行政区划",  创建窗口 = ()=> new F行政区划() },
                    new M三级菜单 { 名称 = "部门架构",  创建窗口 = ()=> new F部门架构() },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "用户",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "账号管理",  创建窗口 = ()=> new F账号管理()  },
                    new M三级菜单 { 名称 = "修改密码",  创建窗口 = ()=> new F修改密码()  },
                    new M三级菜单 { 名称 = "个性化",  创建窗口 = ()=> new F个性化()  },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "备份还原",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "备份还原",  创建窗口 = ()=> new F备份还原()  },
                },
            });
            __一级菜单.子菜单.Add(new M二级菜单
            {
                名称 = "帮助",
                子菜单 = new List<M三级菜单>
                {
                    new M三级菜单 { 名称 = "使用手册",  },
                    new M三级菜单 { 名称 = "反馈",  创建窗口 = ()=> new F反馈()  },
                    new M三级菜单 { 名称 = "关于",  创建窗口 = ()=> new F关于()  },
                },
            });
            一级功能列表.Add(__一级菜单);
        }

    }

}
